Revit 2027 API
FormUtils.CanBeDissolved Method
 Validates that input contains one or more form elements or geom combinations containing form elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool CanBeDissolved(
	Document ADoc,
	ICollection<ElementId> elements
)
Public Shared Function CanBeDissolved (
	ADoc As Document,
	elements As ICollection(Of ElementId)
) As Boolean
public:
static bool CanBeDissolved(
	Document^ ADoc,
	ICollection<ElementId^>^ elements
)
static member CanBeDissolved :
        ADoc : Document *
        elements : ICollection<ElementId> -> bool
Parameters
ADoc Document
 The document.
elements ICollection<ElementId>
 A collection of elements.
Return Value
Boolean
 True if inputs contain one or more form elements. Non-form element inputs are ignored. False if none of the inputs are form elements or do not contain form elements.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FormUtils Class
Autodesk.Revit.DB Namespace